app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
  def index
    @appointments = Appointment.all

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."pet" = ? LIMIT 1  [["pet", "Yesy"]]
---
  def result
    pet_name = params[:pet_name]
    @appointment = Appointment.find_by pet: pet_name

INSERT INTO "appointments" ("customer", "reason", "requires_reminder", "date_of_visit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer", "qwert"], ["reason", "12qwe"], ["requires_reminder", "t"], ["date_of_visit", "2015-03-13"], ["created_at", "2015-03-11 17:41:44.375304"], ["updated_at", "2015-03-11 17:41:44.375304"]]
---
  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save

UPDATE "appointments" SET "date_of_visit" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["date_of_visit", "2015-03-11"], ["updated_at", "2015-03-11 17:52:19.371257"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @appointment.update(appointment_params)

DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 1]]
---
  def destroy
    @appointment.destroy

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_appointment
      @appointment = Appointment.find(params[:id])