app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT "doctors".* FROM "doctors"

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("name", "address", "city", "state", "zip", "school", "years_in_practice", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_doctor
      @doctor = Doctor.find(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]