app/controllers/prescriptions_controller.rb

  def index
    @prescriptions = Prescription.all
---
SELECT "prescriptions".* FROM "prescriptions"

  def create
    @prescription = Prescription.new(prescription_params)

    respond_to do |format|
      if @prescription.save
---
INSERT INTO "prescriptions" ("pet_name", "type_of_pet", "breed", "age", "weight", "date_of_last_visit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_prescription
      @prescription = Prescription.find(params[:id])
---
SELECT  "prescriptions".* FROM "prescriptions" WHERE "prescriptions"."id" = ? LIMIT 1  [["id", 1]]